src/Documents/МаршрутныеЛисты/МаршрутныеЛисты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныеЛисты</name>
  <registerRecords>AccumulationRegister.МаршрутныеЛисты</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.СотрудникиОрганизаций</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>String</types>
      <types>CatalogRef.СотрудникиОрганизаций</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>EnumRef.ВидТарнспортногоТарифа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаказаниеСпидометраНачальный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаказаниеСпидометраКонечный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйОстатокТопливаВБаке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйОстатокТопливаВБаке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоЗаправилЗаПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>String</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратДокументов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьОтбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ФИОФизЛиц/ФИОФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизЛиц</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Транспорт/Транспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Транспорт</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>String</types>
      <types>CatalogRef.СотрудникиОрганизаций</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/МаршрутныеЛисты/МаршрутныеЛисты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МаршрутныеЛисты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТочкиВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидТарифа</name>
    <type>
      <types>EnumRef.ВидТарнспортногоТарифа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/МаршрутныеЛисты/ObjectModule.bsl
Функция РассчиттатьВес(Заказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателяТовары.Количество * ЗаказПокупателяТовары.ЕдиницаИзмерения.Вес КАК Вес
	               |ИЗ
	               |	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	               |ГДЕ
	               |	ЗаказПокупателяТовары.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса.Итог("Вес");  	
		
КонецФункции


Процедура Печать(ПутевойЛист = Ложь) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	Если Не ПутевойЛист Тогда
		Макет = Документы.МаршрутныеЛисты.ПолучитьМакет("Печать");
	Иначе
		Макет = Документы.МаршрутныеЛисты.ПолучитьМакет("ПутевойЛист");
	КонецЕсли; 
	
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);
	// Шапка
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(ЭтотОбъект);
	
	ФИО = "";
	Если ТипЗнч(Водитель)<>Тип("Строка") Тогда
		ТЗ_ФИО = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ТекущаяДата(),Новый Структура("ФизЛицо", Водитель.Физлицо));	
		Если ТЗ_ФИО.Количество() > 0 Тогда
			ФИО = ТЗ_ФИО [0].Фамилия + " " + Лев(ТЗ_ФИО [0].Имя, "1") + ". " + Лев(ТЗ_ФИО [0].Отчество, "1") + "."; 	
			Шапка.Параметры.Водитель = ФИО;	
		КонецЕсли; 
	КонецЕсли; 	
	ТабДок.Вывести(Шапка);
	// Маршрут
	Область = Макет.ПолучитьОбласть("МаршрутШапка");
	ТабДок.Вывести(Область);
	ОбластьМаршрут = Макет.ПолучитьОбласть("Маршрут");
	НомерСтроки = 1;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(МаршрутныеЛистыМаршрут.Заказ) = ТИП(Документ.ЗаказПокупателя)
	               |			ТОГДА МаршрутныеЛистыМаршрут.Заказ.кпкТорговаяТочка
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ТИПЗНАЧЕНИЯ(МаршрутныеЛистыМаршрут.Заказ) = ТИП(СТРОКА)
	               |					ТОГДА МаршрутныеЛистыМаршрут.Заказ
	               |				ИНАЧЕ МаршрутныеЛистыМаршрут.Заказ.СкладПолучатель
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Заказ,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(МаршрутныеЛистыМаршрут.Заказ) = ТИП(Документ.ЗаказПокупателя)
	               |			ТОГДА МаршрутныеЛистыМаршрут.Заказ.кпкТорговаяТочка.Адрес
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК Адрес,
	               |	СУММА(МаршрутныеЛистыМаршрут.Вес) КАК Вес,
	               |	МаршрутныеЛистыМаршрут.Заказ.ДоговорКонтрагента.ВидВзаиморасчетов КАК ВидДоговора
	               |ИЗ
	               |	Документ.МаршрутныеЛисты.Маршрут КАК МаршрутныеЛистыМаршрут
	               |ГДЕ
	               |	МаршрутныеЛистыМаршрут.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(МаршрутныеЛистыМаршрут.Заказ) = ТИП(Документ.ЗаказПокупателя)
	               |			ТОГДА МаршрутныеЛистыМаршрут.Заказ.кпкТорговаяТочка
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ТИПЗНАЧЕНИЯ(МаршрутныеЛистыМаршрут.Заказ) = ТИП(СТРОКА)
	               |					ТОГДА МаршрутныеЛистыМаршрут.Заказ
	               |				ИНАЧЕ МаршрутныеЛистыМаршрут.Заказ.СкладПолучатель
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(МаршрутныеЛистыМаршрут.Заказ) = ТИП(Документ.ЗаказПокупателя)
	               |			ТОГДА МаршрутныеЛистыМаршрут.Заказ.кпкТорговаяТочка.Адрес
	               |		ИНАЧЕ """"
	               |	КОНЕЦ,
	               |	МаршрутныеЛистыМаршрут.Заказ.ДоговорКонтрагента.ВидВзаиморасчетов";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ТаблицаМаршрутов = Запрос.Выполнить().Выгрузить();
	Если НЕ ПутевойЛист Тогда
		ТаблицаМаршрутов = Маршрут;
	КонецЕсли; 
	 
	Для Каждого ТекСтрокаМаршрут Из ТаблицаМаршрутов Цикл
		Если ПутевойЛист И ТипЗнч(ТекСтрокаМаршрут.Заказ) <> Тип("Строка") И ЗначениеЗаполнено(ТекСтрокаМаршрут.ВидДоговора) Тогда
			Если ТекСтрокаМаршрут.ВидДоговора.Код = "000000001" Тогда
					Продолжить;
			КонецЕсли; 
		КонецЕсли; 
		//ОбластьМаршрут.Параметры.Заполнить(ТекСтрокаМаршрут);
		Если ТипЗнч(ТекСтрокаМаршрут.Заказ) = Тип("Строка") ИЛИ ТипЗнч(ТекСтрокаМаршрут.Заказ) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ОбластьМаршрут.Параметры.ТТ = ТекСтрокаМаршрут.Заказ;
			ОбластьМаршрут.Параметры.Адрес = "";
			Если НЕ ПутевойЛист Тогда
				ОбластьМаршрут.Параметры.Клиент = ТекСтрокаМаршрут.Заказ;			
				ОбластьМаршрут.Параметры.Документ = "";	
			КонецЕсли; 
			
		Иначе
			Если ПутевойЛист Тогда
				ОбластьМаршрут.Параметры.ТТ = ТекСтрокаМаршрут.Заказ;
				ОбластьМаршрут.Параметры.Адрес = ТекСтрокаМаршрут.Адрес;	
			иначе
				ОбластьМаршрут.Параметры.ТТ = ТекСтрокаМаршрут.Заказ.кпкТорговаяТочка;
				ОбластьМаршрут.Параметры.Адрес = ТекСтрокаМаршрут.Заказ.кпкТорговаяТочка.Адрес;	
				Имя = ТекСтрокаМаршрут.Заказ.Метаданные().Синоним;
				ИмяДокумента = Лев(Имя, Найти(Имя, " ")); 
				ОбластьМаршрут.Параметры.Документ = ИмяДокумента + ТекСтрокаМаршрут.Заказ.Номер + " " + Формат(ТекСтрокаМаршрут.Заказ.Дата, "ДФ=dd.MM.yy");			
				ОбластьМаршрут.Параметры.Клиент = ТекСтрокаМаршрут.Заказ.Контрагент;	
			КонецЕсли;			
			
		КонецЕсли; 
		Если НЕ ПутевойЛист Тогда
			ОбластьМаршрут.Параметры.НомерСтроки = ТекСтрокаМаршрут.НомерСтроки;
			ОбластьМаршрут.Параметры.Вес = ТекСтрокаМаршрут.Вес;
		Иначе
			ОбластьМаршрут.Параметры.НомерСтроки = НомерСтроки;
		КонецЕсли; 
		
		
		ТабДок.Вывести(ОбластьМаршрут);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	// Подвал
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Если НЕ ПутевойЛист Тогда
		Подвал.Параметры.ОбщийВес = Маршрут.Итог("Вес");
	Иначе
		ПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТабДок.Вывести(ПустаяСтрока);
	КонецЕсли;
	Подвал.Параметры.Заполнить(ЭтотОбъект);
	Если ФИО <> "" Тогда
		Подвал.Параметры.Водитель = ФИО;
	КонецЕсли; 
	Подвал.Параметры.Расход100 = ?(Пробег=0, 0, Расход/(Пробег/100)); 
	НЗ = РегистрыСведений.Транспорт.СоздатьНаборЗаписей();
	НЗ.Отбор.Водитель.Установить(Водитель);	
	НЗ.Прочитать();

	ТабДок.Вывести(Подвал);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.МаршрутныеЛисты.Записывать = Истина;
	Движения.МаршрутныеЛисты.Очистить();
	Движение = Движения.МаршрутныеЛисты.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Водитель;
	Движение.Подразделение = Подразделение;
	Движение.ВидТарифа = Тариф;
	Движение.Пробег = Пробег;
	Движение.Расход = Расход;
	Движение.Вес = Маршрут.Итог("Вес");
    КоличествоТТ = 0;
    Для каждого строка Из Маршрут Цикл
    	
    КонецЦикла; 
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |    КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаршрутныеЛистыМаршрут.Заказ.кпкТорговаяТочка) КАК КоличествоТТ
                   |ПОМЕСТИТЬ ЗаказТТ
                   |ИЗ
                   |    Документ.МаршрутныеЛисты.Маршрут КАК МаршрутныеЛистыМаршрут
                   |ГДЕ
                   |    МаршрутныеЛистыМаршрут.Заказ ССЫЛКА Документ.ЗаказПокупателя
                   |    И МаршрутныеЛистыМаршрут.Ссылка = &Ссылка
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |    КОЛИЧЕСТВО(МаршрутныеЛистыМаршрут.Заказ)
                   |ИЗ
                   |    Документ.МаршрутныеЛисты.Маршрут КАК МаршрутныеЛистыМаршрут
                   |ГДЕ
                   |    НЕ МаршрутныеЛистыМаршрут.Заказ ССЫЛКА Документ.ЗаказПокупателя
                   |    И МаршрутныеЛистыМаршрут.Ссылка = &Ссылка
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    СУММА(ЗаказТТ.КоличествоТТ) КАК КоличествоТТ
                   |ИЗ
                   |    ЗаказТТ КАК ЗаказТТ";
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    ТТ = Запрос.Выполнить().Выбрать();
    ТТ.Следующий();
     
	Движение.ТочкиВыгрузки = ТТ.КоличествоТТ;
КонецПроцедуры
